[
    {
        "label": "Project",
        "active": "yes",
        "inspiration" : "Professional",
        "title": "Test Bench",
        "shortDescription": "Added value to the tooling test bench by adding access to a second robotic arm and integrated scale",
        "longDescription": "Integrating the new hardware included changes to the hardware and software of the test bench. I re-wired low voltage control systems based off production drawings. Following the hardware upgrades I updated existing software designed to interface witha singular robot to communicate with a second robot and a scale. The scale had not previously been integrated into the software. Both robots and the scale were all integrated over TCP to a single HMI computer",
        "date" : "2021-03-01",
        "skills" : "VBA, Controls, Software, Robotics",
        "images":
        [
        
        ],
        "links": []
    },
    {
        "label": "Project",
        "active": "yes",
        "inspiration" : "Professional",
        "title": "PDM Part Number Add-in",
        "shortDescription": "Developed a customized add-in for PDM to handle part numbering",
        "longDescription": "Utilized SolidWorks PDM integrated API to create an add in to intercept and add characters to the standard part numbering structure. This involved learning the API and how to test the add-in. This was especially difficult as PDM binds to Windows explorer, which needs ot be restarted to test different version of the add-in",
        "date" : "2019-12-01",
        "skills" : "PDM, programming, problem-solving",
        "images":
        [
        
        ],
        "links": []
    },
    {
        "label": "Project",
        "active": "no",
        "inspiration" : "Personal",
        "title": "Robotic Arm",
        "shortDescription": "Designed and building 5 degree of freedom robotic arm",
        "longDescription": "Using OnShape's online CAD platform I was able to design a relatively simple 5 DOF robotic arm. The project has started with a 4 DOF arm, meaning that the 'shoulder' of the arm is fixed. The fifth DOF will be added by swapping the shoulder mount for one that can rotate to enable the arm to increase it's functional coverage. The current design for the gripper features a rack and pinion style clamp which should be able to grasp desired objects. ",
        "date" : "2020-05-01",
        "skills" : "Robotics, CAD, Electronics, Stepper Motors, Rapid Prototyping, Machine Design",
        "images":
        [
            {"file":"../images/armRender.png","tag":"Model of Robotic Arm"}
            
            
        ],
        "links": [{"path":"https://cad.onshape.com/documents/a61ad361cff0dca7d200098c/w/ed87d6f19a6087228eeedc1c/e/d54eea925c588178331dd798","text":"OnShape Model"}]
    },
    {
        "label": "Project",
        "active": "yes",
        "inspiration" : "Personal",
        "title": "Resume Website",
        "shortDescription": "Designed and developed resume website. Created in Gatsby",
        "longDescription": "I was able to put my programming skills to use in developing this website. The site is constructed using GatsbyJS, React, and nodeJS. Using the static site generator, each work experience line item, and project line item are integrated into JSON files. Additionally the ",
        "links": [{"path":"https://github.com/STEWMACD/ResumeSite","text":"Github Repo"}],
        "date" : "2020-05-01",
        "skills": "Programming, design, web development, Javascript, HTML",
        "images":
        [
            
        ]
    },
    {
        "label": "Project",
        "active": "yes",
        "inspiration" : "Academics",
        "title": "3D Printed Axial Flux Motor",
        "shortDescription": "Designed, manufactured and programmed a small axial flux motor",
        "longDescription": "For an Electro-Mechanical Machines course, we had to build a small scale electric motor as a final project. Looking for something unique to earn our team extra points, we stumbled upon axial flux or pancake motors. Using inspiration from other similar motors we found online, we developed a 3 phase motor which was able to achieve 10,000 RPM, with 11W of power consumption. The motor speed was dictated using a potentiometer dial telling an arduino to pass a PWM signal to a Motor Speed Controller. Using off the shelf components, rather than building a motor controller allowed us to quickly get top tier results. The design also featured a hall-effect sensor creating an tachometer on an LCD screen.",
        "date" : "2018-06-01",
        "skills": "3D Printing, electronics, motors, micro-controllers, sensors",
        "images":
        [
            {"file":"../images/ElecMotorRender.JPG","tag":"Rendering of SolidWorks 3D model"},
            {"file":"../images/MotorFinal.jpg","tag":"Assembled motor"},
            {"file":"../images/MotorVideoThumb.jpg","videoURL":"https://www.youtube.com/embed/MqhGVivqohM","tag":"Video of motor running"},
            {"file":"../images/10000RPM.JPG","tag":"10,000 rip'ems"}
        ]
    },
    {
        "label": "Project",
        "active": "no",
        "inspiration" : "Personal",
        "title": "3D Printer - Creality Ender 3 ",
        "shortDescription": "Built and used Ender 3 model 3D printer",
        "longDescription": "Bought and assembled a Creality Ender 3 kit. Once assembled, the printer was used extensively in other projects, some of which are listed here. In order to efficiently produce prints, certain upgrades had to be printed, sourced or programmed for the machine. Many of the printed solutions were found online and provided a great resource to dial in the 3D printer slicer settings. Replaced stock components with upgraded components. The main change to programming was introducing Thermal-Runaway protection via flashing new firmware onto the mainboard.",
        "date" : "2020-01-01",
        "skills": "Assembly, Machine design, 3D printing, electronics",
        "images":
        [
            {"file":"../images/Printer.jpg","tag":"Creality Ender 3"}
        ]
    },
    {
        "label": "Project",
        "active": "yes",
        "inspiration" : "Academic",
        "title": "Single Stage Reduction Gearbox",
        "shortDescription": "Designed transmission based upon material properties and dimensional requirements",
        "longDescription": "The task given was to develop a single stage gearbox to output power for a ship. The details of project required our team to select materials from a list of options, determine appropriate geometry for the components, and model our end result. This was my first experience in the nitty-gritty of design, and gave me familiarity with the Shigley's book.",
        "date" : "2018-06-01",
        "skills": "SolidWorks, machine design, material selection, power transmission",
        "images":
        [
            {"file":"../images/gearbox-asm-dwg.PNG","tag":"SolidWorks assembly drawing of gearbox project"},
            {"file":"../images/Render.JPG","tag":"Gearbox rendering"}
        ]
    }
]